konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/pads_bank0.inc
#
# Derived from Raspberry Pi Pico SDK
#
# Copyright (c) 2024 Raspberry Pi Ltd.
#
# Redistribution and use permitted under BSD 3-Clause terms.
# See full license in THIRD_PARTY_LICENSES/PICO_SDK_LICENSE.txt
#
# =============================================================================
# Register block : PADS_BANK0
# Version        : 1
# Bus type       : apb
# =============================================================================
.ifndef	_HARDWARE_REGS_PADS_BANK0_H
.set	_HARDWARE_REGS_PADS_BANK0_H, 1
# =============================================================================
# Register    : PADS_BANK0_VOLTAGE_SELECT
# Description : Voltage select. Per bank control
#               0x0 -> Set voltage to 3.3V (DVDD >= 2V5)
#               0x1 -> Set voltage to 1.8V (DVDD <= 1V8)
.equ	PADS_BANK0_VOLTAGE_SELECT_OFFSET, 0x00000000
.equ	PADS_BANK0_VOLTAGE_SELECT_BITS, 0x00000001
.equ	PADS_BANK0_VOLTAGE_SELECT_RESET, 0x00000000
.equ	PADS_BANK0_VOLTAGE_SELECT_MSB, 0
.equ	PADS_BANK0_VOLTAGE_SELECT_LSB, 0
.equ	PADS_BANK0_VOLTAGE_SELECT_VALUE_3V3, 0x0
.equ	PADS_BANK0_VOLTAGE_SELECT_VALUE_1V8, 0x1
# =============================================================================
# Register    : PADS_BANK0_GPIO0
.equ	PADS_BANK0_GPIO0_OFFSET, 0x00000004
.equ	PADS_BANK0_GPIO0_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO0_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO0_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO0_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO0_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO0_ISO_MSB, 8
.equ	PADS_BANK0_GPIO0_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO0_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO0_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO0_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO0_OD_MSB, 7
.equ	PADS_BANK0_GPIO0_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO0_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO0_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO0_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO0_IE_MSB, 6
.equ	PADS_BANK0_GPIO0_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO0_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO0_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO0_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO0_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO0_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO0_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO0_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO0_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO0_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO0_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO0_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO0_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO0_PUE_MSB, 3
.equ	PADS_BANK0_GPIO0_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO0_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO0_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO0_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO0_PDE_MSB, 2
.equ	PADS_BANK0_GPIO0_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO0_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO0_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO0_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO0_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO0_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO0_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO0_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO0_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO0_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO0_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO1
.equ	PADS_BANK0_GPIO1_OFFSET, 0x00000008
.equ	PADS_BANK0_GPIO1_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO1_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO1_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO1_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO1_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO1_ISO_MSB, 8
.equ	PADS_BANK0_GPIO1_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO1_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO1_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO1_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO1_OD_MSB, 7
.equ	PADS_BANK0_GPIO1_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO1_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO1_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO1_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO1_IE_MSB, 6
.equ	PADS_BANK0_GPIO1_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO1_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO1_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO1_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO1_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO1_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO1_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO1_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO1_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO1_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO1_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO1_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO1_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO1_PUE_MSB, 3
.equ	PADS_BANK0_GPIO1_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO1_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO1_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO1_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO1_PDE_MSB, 2
.equ	PADS_BANK0_GPIO1_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO1_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO1_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO1_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO1_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO1_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO1_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO1_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO1_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO1_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO1_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO2
.equ	PADS_BANK0_GPIO2_OFFSET, 0x0000000c
.equ	PADS_BANK0_GPIO2_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO2_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO2_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO2_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO2_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO2_ISO_MSB, 8
.equ	PADS_BANK0_GPIO2_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO2_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO2_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO2_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO2_OD_MSB, 7
.equ	PADS_BANK0_GPIO2_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO2_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO2_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO2_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO2_IE_MSB, 6
.equ	PADS_BANK0_GPIO2_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO2_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO2_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO2_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO2_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO2_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO2_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO2_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO2_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO2_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO2_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO2_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO2_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO2_PUE_MSB, 3
.equ	PADS_BANK0_GPIO2_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO2_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO2_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO2_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO2_PDE_MSB, 2
.equ	PADS_BANK0_GPIO2_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO2_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO2_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO2_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO2_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO2_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO2_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO2_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO2_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO2_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO2_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO3
.equ	PADS_BANK0_GPIO3_OFFSET, 0x00000010
.equ	PADS_BANK0_GPIO3_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO3_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO3_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO3_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO3_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO3_ISO_MSB, 8
.equ	PADS_BANK0_GPIO3_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO3_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO3_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO3_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO3_OD_MSB, 7
.equ	PADS_BANK0_GPIO3_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO3_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO3_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO3_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO3_IE_MSB, 6
.equ	PADS_BANK0_GPIO3_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO3_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO3_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO3_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO3_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO3_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO3_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO3_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO3_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO3_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO3_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO3_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO3_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO3_PUE_MSB, 3
.equ	PADS_BANK0_GPIO3_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO3_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO3_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO3_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO3_PDE_MSB, 2
.equ	PADS_BANK0_GPIO3_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO3_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO3_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO3_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO3_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO3_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO3_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO3_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO3_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO3_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO3_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO4
.equ	PADS_BANK0_GPIO4_OFFSET, 0x00000014
.equ	PADS_BANK0_GPIO4_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO4_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO4_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO4_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO4_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO4_ISO_MSB, 8
.equ	PADS_BANK0_GPIO4_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO4_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO4_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO4_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO4_OD_MSB, 7
.equ	PADS_BANK0_GPIO4_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO4_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO4_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO4_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO4_IE_MSB, 6
.equ	PADS_BANK0_GPIO4_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO4_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO4_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO4_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO4_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO4_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO4_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO4_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO4_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO4_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO4_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO4_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO4_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO4_PUE_MSB, 3
.equ	PADS_BANK0_GPIO4_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO4_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO4_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO4_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO4_PDE_MSB, 2
.equ	PADS_BANK0_GPIO4_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO4_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO4_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO4_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO4_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO4_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO4_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO4_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO4_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO4_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO4_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO5
.equ	PADS_BANK0_GPIO5_OFFSET, 0x00000018
.equ	PADS_BANK0_GPIO5_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO5_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO5_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO5_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO5_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO5_ISO_MSB, 8
.equ	PADS_BANK0_GPIO5_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO5_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO5_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO5_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO5_OD_MSB, 7
.equ	PADS_BANK0_GPIO5_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO5_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO5_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO5_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO5_IE_MSB, 6
.equ	PADS_BANK0_GPIO5_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO5_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO5_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO5_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO5_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO5_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO5_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO5_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO5_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO5_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO5_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO5_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO5_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO5_PUE_MSB, 3
.equ	PADS_BANK0_GPIO5_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO5_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO5_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO5_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO5_PDE_MSB, 2
.equ	PADS_BANK0_GPIO5_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO5_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO5_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO5_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO5_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO5_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO5_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO5_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO5_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO5_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO5_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO6
.equ	PADS_BANK0_GPIO6_OFFSET, 0x0000001c
.equ	PADS_BANK0_GPIO6_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO6_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO6_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO6_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO6_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO6_ISO_MSB, 8
.equ	PADS_BANK0_GPIO6_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO6_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO6_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO6_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO6_OD_MSB, 7
.equ	PADS_BANK0_GPIO6_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO6_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO6_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO6_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO6_IE_MSB, 6
.equ	PADS_BANK0_GPIO6_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO6_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO6_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO6_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO6_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO6_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO6_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO6_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO6_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO6_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO6_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO6_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO6_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO6_PUE_MSB, 3
.equ	PADS_BANK0_GPIO6_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO6_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO6_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO6_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO6_PDE_MSB, 2
.equ	PADS_BANK0_GPIO6_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO6_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO6_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO6_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO6_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO6_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO6_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO6_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO6_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO6_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO6_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO7
.equ	PADS_BANK0_GPIO7_OFFSET, 0x00000020
.equ	PADS_BANK0_GPIO7_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO7_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO7_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO7_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO7_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO7_ISO_MSB, 8
.equ	PADS_BANK0_GPIO7_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO7_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO7_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO7_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO7_OD_MSB, 7
.equ	PADS_BANK0_GPIO7_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO7_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO7_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO7_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO7_IE_MSB, 6
.equ	PADS_BANK0_GPIO7_IE_LSB, 6
