konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/pads_bank0.inc
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO7_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO7_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO7_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO7_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO7_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO7_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO7_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO7_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO7_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO7_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO7_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO7_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO7_PUE_MSB, 3
.equ	PADS_BANK0_GPIO7_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO7_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO7_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO7_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO7_PDE_MSB, 2
.equ	PADS_BANK0_GPIO7_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO7_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO7_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO7_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO7_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO7_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO7_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO7_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO7_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO7_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO7_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO8
.equ	PADS_BANK0_GPIO8_OFFSET, 0x00000024
.equ	PADS_BANK0_GPIO8_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO8_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO8_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO8_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO8_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO8_ISO_MSB, 8
.equ	PADS_BANK0_GPIO8_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO8_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO8_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO8_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO8_OD_MSB, 7
.equ	PADS_BANK0_GPIO8_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO8_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO8_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO8_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO8_IE_MSB, 6
.equ	PADS_BANK0_GPIO8_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO8_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO8_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO8_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO8_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO8_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO8_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO8_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO8_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO8_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO8_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO8_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO8_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO8_PUE_MSB, 3
.equ	PADS_BANK0_GPIO8_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO8_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO8_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO8_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO8_PDE_MSB, 2
.equ	PADS_BANK0_GPIO8_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO8_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO8_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO8_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO8_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO8_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO8_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO8_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO8_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO8_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO8_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO9
.equ	PADS_BANK0_GPIO9_OFFSET, 0x00000028
.equ	PADS_BANK0_GPIO9_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO9_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO9_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO9_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO9_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO9_ISO_MSB, 8
.equ	PADS_BANK0_GPIO9_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO9_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO9_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO9_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO9_OD_MSB, 7
.equ	PADS_BANK0_GPIO9_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO9_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO9_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO9_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO9_IE_MSB, 6
.equ	PADS_BANK0_GPIO9_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO9_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO9_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO9_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO9_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO9_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO9_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO9_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO9_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO9_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO9_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO9_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO9_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO9_PUE_MSB, 3
.equ	PADS_BANK0_GPIO9_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO9_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO9_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO9_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO9_PDE_MSB, 2
.equ	PADS_BANK0_GPIO9_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO9_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO9_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO9_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO9_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO9_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO9_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO9_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO9_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO9_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO9_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO10
.equ	PADS_BANK0_GPIO10_OFFSET, 0x0000002c
.equ	PADS_BANK0_GPIO10_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO10_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO10_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO10_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO10_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO10_ISO_MSB, 8
.equ	PADS_BANK0_GPIO10_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO10_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO10_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO10_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO10_OD_MSB, 7
.equ	PADS_BANK0_GPIO10_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO10_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO10_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO10_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO10_IE_MSB, 6
.equ	PADS_BANK0_GPIO10_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO10_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO10_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO10_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO10_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO10_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO10_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO10_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO10_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO10_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO10_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO10_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO10_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO10_PUE_MSB, 3
.equ	PADS_BANK0_GPIO10_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO10_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO10_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO10_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO10_PDE_MSB, 2
.equ	PADS_BANK0_GPIO10_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO10_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO10_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO10_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO10_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO10_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO10_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO10_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO10_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO10_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO10_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO11
.equ	PADS_BANK0_GPIO11_OFFSET, 0x00000030
.equ	PADS_BANK0_GPIO11_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO11_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO11_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO11_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO11_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO11_ISO_MSB, 8
.equ	PADS_BANK0_GPIO11_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO11_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO11_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO11_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO11_OD_MSB, 7
.equ	PADS_BANK0_GPIO11_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO11_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO11_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO11_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO11_IE_MSB, 6
.equ	PADS_BANK0_GPIO11_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO11_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO11_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO11_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO11_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO11_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO11_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO11_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO11_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO11_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO11_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO11_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO11_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO11_PUE_MSB, 3
.equ	PADS_BANK0_GPIO11_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO11_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO11_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO11_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO11_PDE_MSB, 2
.equ	PADS_BANK0_GPIO11_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO11_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO11_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO11_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO11_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO11_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO11_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO11_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO11_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO11_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO11_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO12
.equ	PADS_BANK0_GPIO12_OFFSET, 0x00000034
.equ	PADS_BANK0_GPIO12_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO12_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO12_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO12_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO12_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO12_ISO_MSB, 8
.equ	PADS_BANK0_GPIO12_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO12_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO12_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO12_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO12_OD_MSB, 7
.equ	PADS_BANK0_GPIO12_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO12_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO12_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO12_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO12_IE_MSB, 6
.equ	PADS_BANK0_GPIO12_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO12_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO12_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO12_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO12_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO12_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO12_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO12_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO12_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO12_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO12_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO12_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO12_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO12_PUE_MSB, 3
.equ	PADS_BANK0_GPIO12_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO12_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO12_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO12_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO12_PDE_MSB, 2
.equ	PADS_BANK0_GPIO12_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO12_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO12_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO12_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO12_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO12_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO12_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO12_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO12_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO12_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO12_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO13
.equ	PADS_BANK0_GPIO13_OFFSET, 0x00000038
.equ	PADS_BANK0_GPIO13_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO13_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO13_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO13_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO13_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO13_ISO_MSB, 8
.equ	PADS_BANK0_GPIO13_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO13_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO13_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO13_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO13_OD_MSB, 7
.equ	PADS_BANK0_GPIO13_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO13_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO13_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO13_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO13_IE_MSB, 6
.equ	PADS_BANK0_GPIO13_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO13_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO13_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO13_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO13_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO13_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO13_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO13_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO13_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO13_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO13_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO13_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO13_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO13_PUE_MSB, 3
.equ	PADS_BANK0_GPIO13_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO13_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO13_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO13_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO13_PDE_MSB, 2
.equ	PADS_BANK0_GPIO13_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO13_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO13_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO13_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO13_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO13_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO13_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO13_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO13_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO13_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO13_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO14
.equ	PADS_BANK0_GPIO14_OFFSET, 0x0000003c
.equ	PADS_BANK0_GPIO14_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO14_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO14_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO14_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO14_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO14_ISO_MSB, 8
.equ	PADS_BANK0_GPIO14_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO14_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO14_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO14_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO14_OD_MSB, 7
.equ	PADS_BANK0_GPIO14_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO14_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO14_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO14_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO14_IE_MSB, 6
.equ	PADS_BANK0_GPIO14_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO14_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO14_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO14_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO14_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO14_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO14_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO14_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO14_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO14_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO14_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO14_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO14_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO14_PUE_MSB, 3
.equ	PADS_BANK0_GPIO14_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO14_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO14_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO14_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO14_PDE_MSB, 2
.equ	PADS_BANK0_GPIO14_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO14_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO14_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO14_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO14_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO14_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO14_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO14_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO14_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO14_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO14_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO15
.equ	PADS_BANK0_GPIO15_OFFSET, 0x00000040
.equ	PADS_BANK0_GPIO15_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO15_RESET, 0x00000116
# -----------------------------------------------------------------------------
