konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/pads_bank0.inc
# Field       : PADS_BANK0_GPIO15_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO15_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO15_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO15_ISO_MSB, 8
.equ	PADS_BANK0_GPIO15_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO15_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO15_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO15_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO15_OD_MSB, 7
.equ	PADS_BANK0_GPIO15_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO15_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO15_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO15_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO15_IE_MSB, 6
.equ	PADS_BANK0_GPIO15_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO15_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO15_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO15_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO15_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO15_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO15_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO15_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO15_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO15_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO15_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO15_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO15_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO15_PUE_MSB, 3
.equ	PADS_BANK0_GPIO15_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO15_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO15_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO15_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO15_PDE_MSB, 2
.equ	PADS_BANK0_GPIO15_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO15_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO15_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO15_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO15_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO15_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO15_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO15_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO15_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO15_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO15_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO16
.equ	PADS_BANK0_GPIO16_OFFSET, 0x00000044
.equ	PADS_BANK0_GPIO16_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO16_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO16_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO16_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO16_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO16_ISO_MSB, 8
.equ	PADS_BANK0_GPIO16_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO16_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO16_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO16_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO16_OD_MSB, 7
.equ	PADS_BANK0_GPIO16_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO16_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO16_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO16_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO16_IE_MSB, 6
.equ	PADS_BANK0_GPIO16_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO16_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO16_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO16_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO16_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO16_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO16_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO16_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO16_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO16_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO16_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO16_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO16_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO16_PUE_MSB, 3
.equ	PADS_BANK0_GPIO16_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO16_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO16_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO16_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO16_PDE_MSB, 2
.equ	PADS_BANK0_GPIO16_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO16_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO16_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO16_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO16_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO16_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO16_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO16_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO16_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO16_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO16_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO17
.equ	PADS_BANK0_GPIO17_OFFSET, 0x00000048
.equ	PADS_BANK0_GPIO17_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO17_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO17_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO17_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO17_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO17_ISO_MSB, 8
.equ	PADS_BANK0_GPIO17_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO17_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO17_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO17_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO17_OD_MSB, 7
.equ	PADS_BANK0_GPIO17_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO17_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO17_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO17_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO17_IE_MSB, 6
.equ	PADS_BANK0_GPIO17_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO17_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO17_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO17_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO17_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO17_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO17_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO17_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO17_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO17_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO17_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO17_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO17_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO17_PUE_MSB, 3
.equ	PADS_BANK0_GPIO17_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO17_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO17_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO17_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO17_PDE_MSB, 2
.equ	PADS_BANK0_GPIO17_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO17_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO17_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO17_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO17_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO17_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO17_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO17_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO17_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO17_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO17_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO18
.equ	PADS_BANK0_GPIO18_OFFSET, 0x0000004c
.equ	PADS_BANK0_GPIO18_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO18_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO18_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO18_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO18_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO18_ISO_MSB, 8
.equ	PADS_BANK0_GPIO18_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO18_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO18_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO18_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO18_OD_MSB, 7
.equ	PADS_BANK0_GPIO18_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO18_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO18_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO18_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO18_IE_MSB, 6
.equ	PADS_BANK0_GPIO18_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO18_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO18_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO18_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO18_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO18_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO18_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO18_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO18_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO18_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO18_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO18_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO18_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO18_PUE_MSB, 3
.equ	PADS_BANK0_GPIO18_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO18_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO18_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO18_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO18_PDE_MSB, 2
.equ	PADS_BANK0_GPIO18_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO18_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO18_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO18_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO18_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO18_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO18_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO18_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO18_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO18_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO18_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO19
.equ	PADS_BANK0_GPIO19_OFFSET, 0x00000050
.equ	PADS_BANK0_GPIO19_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO19_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO19_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO19_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO19_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO19_ISO_MSB, 8
.equ	PADS_BANK0_GPIO19_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO19_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO19_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO19_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO19_OD_MSB, 7
.equ	PADS_BANK0_GPIO19_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO19_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO19_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO19_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO19_IE_MSB, 6
.equ	PADS_BANK0_GPIO19_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO19_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO19_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO19_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO19_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO19_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO19_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO19_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO19_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO19_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO19_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO19_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO19_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO19_PUE_MSB, 3
.equ	PADS_BANK0_GPIO19_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO19_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO19_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO19_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO19_PDE_MSB, 2
.equ	PADS_BANK0_GPIO19_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO19_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO19_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO19_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO19_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO19_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO19_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO19_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO19_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO19_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO19_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO20
.equ	PADS_BANK0_GPIO20_OFFSET, 0x00000054
.equ	PADS_BANK0_GPIO20_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO20_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO20_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO20_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO20_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO20_ISO_MSB, 8
.equ	PADS_BANK0_GPIO20_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO20_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO20_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO20_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO20_OD_MSB, 7
.equ	PADS_BANK0_GPIO20_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO20_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO20_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO20_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO20_IE_MSB, 6
.equ	PADS_BANK0_GPIO20_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO20_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO20_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO20_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO20_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO20_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO20_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO20_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO20_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO20_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO20_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO20_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO20_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO20_PUE_MSB, 3
.equ	PADS_BANK0_GPIO20_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO20_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO20_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO20_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO20_PDE_MSB, 2
.equ	PADS_BANK0_GPIO20_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO20_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO20_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO20_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO20_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO20_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO20_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO20_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO20_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO20_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO20_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO21
.equ	PADS_BANK0_GPIO21_OFFSET, 0x00000058
.equ	PADS_BANK0_GPIO21_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO21_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO21_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO21_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO21_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO21_ISO_MSB, 8
.equ	PADS_BANK0_GPIO21_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO21_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO21_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO21_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO21_OD_MSB, 7
.equ	PADS_BANK0_GPIO21_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO21_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO21_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO21_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO21_IE_MSB, 6
.equ	PADS_BANK0_GPIO21_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO21_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO21_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO21_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO21_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO21_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO21_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO21_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO21_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO21_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO21_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO21_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO21_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO21_PUE_MSB, 3
.equ	PADS_BANK0_GPIO21_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO21_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO21_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO21_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO21_PDE_MSB, 2
.equ	PADS_BANK0_GPIO21_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO21_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO21_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO21_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO21_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO21_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO21_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO21_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO21_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO21_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO21_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO22
.equ	PADS_BANK0_GPIO22_OFFSET, 0x0000005c
.equ	PADS_BANK0_GPIO22_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO22_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO22_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO22_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO22_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO22_ISO_MSB, 8
.equ	PADS_BANK0_GPIO22_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO22_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO22_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO22_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO22_OD_MSB, 7
.equ	PADS_BANK0_GPIO22_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO22_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO22_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO22_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO22_IE_MSB, 6
.equ	PADS_BANK0_GPIO22_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO22_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO22_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO22_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO22_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO22_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO22_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO22_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO22_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO22_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO22_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO22_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO22_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO22_PUE_MSB, 3
.equ	PADS_BANK0_GPIO22_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO22_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO22_PDE_RESET, 0x1
