konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/pads_bank0.inc
.equ	PADS_BANK0_GPIO22_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO22_PDE_MSB, 2
.equ	PADS_BANK0_GPIO22_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO22_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO22_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO22_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO22_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO22_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO22_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO22_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO22_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO22_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO22_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO23
.equ	PADS_BANK0_GPIO23_OFFSET, 0x00000060
.equ	PADS_BANK0_GPIO23_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO23_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO23_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO23_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO23_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO23_ISO_MSB, 8
.equ	PADS_BANK0_GPIO23_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO23_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO23_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO23_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO23_OD_MSB, 7
.equ	PADS_BANK0_GPIO23_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO23_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO23_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO23_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO23_IE_MSB, 6
.equ	PADS_BANK0_GPIO23_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO23_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO23_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO23_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO23_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO23_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO23_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO23_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO23_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO23_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO23_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO23_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO23_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO23_PUE_MSB, 3
.equ	PADS_BANK0_GPIO23_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO23_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO23_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO23_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO23_PDE_MSB, 2
.equ	PADS_BANK0_GPIO23_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO23_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO23_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO23_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO23_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO23_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO23_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO23_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO23_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO23_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO23_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO24
.equ	PADS_BANK0_GPIO24_OFFSET, 0x00000064
.equ	PADS_BANK0_GPIO24_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO24_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO24_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO24_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO24_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO24_ISO_MSB, 8
.equ	PADS_BANK0_GPIO24_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO24_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO24_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO24_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO24_OD_MSB, 7
.equ	PADS_BANK0_GPIO24_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO24_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO24_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO24_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO24_IE_MSB, 6
.equ	PADS_BANK0_GPIO24_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO24_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO24_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO24_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO24_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO24_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO24_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO24_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO24_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO24_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO24_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO24_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO24_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO24_PUE_MSB, 3
.equ	PADS_BANK0_GPIO24_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO24_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO24_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO24_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO24_PDE_MSB, 2
.equ	PADS_BANK0_GPIO24_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO24_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO24_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO24_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO24_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO24_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO24_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO24_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO24_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO24_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO24_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO25
.equ	PADS_BANK0_GPIO25_OFFSET, 0x00000068
.equ	PADS_BANK0_GPIO25_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO25_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO25_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO25_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO25_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO25_ISO_MSB, 8
.equ	PADS_BANK0_GPIO25_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO25_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO25_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO25_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO25_OD_MSB, 7
.equ	PADS_BANK0_GPIO25_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO25_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO25_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO25_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO25_IE_MSB, 6
.equ	PADS_BANK0_GPIO25_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO25_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO25_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO25_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO25_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO25_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO25_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO25_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO25_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO25_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO25_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO25_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO25_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO25_PUE_MSB, 3
.equ	PADS_BANK0_GPIO25_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO25_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO25_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO25_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO25_PDE_MSB, 2
.equ	PADS_BANK0_GPIO25_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO25_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO25_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO25_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO25_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO25_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO25_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO25_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO25_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO25_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO25_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO26
.equ	PADS_BANK0_GPIO26_OFFSET, 0x0000006c
.equ	PADS_BANK0_GPIO26_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO26_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO26_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO26_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO26_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO26_ISO_MSB, 8
.equ	PADS_BANK0_GPIO26_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO26_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO26_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO26_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO26_OD_MSB, 7
.equ	PADS_BANK0_GPIO26_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO26_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO26_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO26_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO26_IE_MSB, 6
.equ	PADS_BANK0_GPIO26_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO26_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO26_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO26_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO26_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO26_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO26_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO26_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO26_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO26_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO26_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO26_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO26_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO26_PUE_MSB, 3
.equ	PADS_BANK0_GPIO26_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO26_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO26_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO26_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO26_PDE_MSB, 2
.equ	PADS_BANK0_GPIO26_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO26_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO26_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO26_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO26_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO26_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO26_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO26_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO26_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO26_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO26_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO27
.equ	PADS_BANK0_GPIO27_OFFSET, 0x00000070
.equ	PADS_BANK0_GPIO27_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO27_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO27_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO27_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO27_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO27_ISO_MSB, 8
.equ	PADS_BANK0_GPIO27_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO27_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO27_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO27_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO27_OD_MSB, 7
.equ	PADS_BANK0_GPIO27_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO27_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO27_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO27_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO27_IE_MSB, 6
.equ	PADS_BANK0_GPIO27_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO27_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO27_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO27_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO27_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO27_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO27_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO27_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO27_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO27_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO27_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO27_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO27_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO27_PUE_MSB, 3
.equ	PADS_BANK0_GPIO27_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO27_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO27_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO27_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO27_PDE_MSB, 2
.equ	PADS_BANK0_GPIO27_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO27_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO27_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO27_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO27_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO27_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO27_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO27_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO27_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO27_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO27_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO28
.equ	PADS_BANK0_GPIO28_OFFSET, 0x00000074
.equ	PADS_BANK0_GPIO28_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO28_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO28_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO28_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO28_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO28_ISO_MSB, 8
.equ	PADS_BANK0_GPIO28_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO28_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO28_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO28_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO28_OD_MSB, 7
.equ	PADS_BANK0_GPIO28_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO28_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO28_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO28_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO28_IE_MSB, 6
.equ	PADS_BANK0_GPIO28_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO28_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO28_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO28_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO28_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO28_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO28_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO28_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO28_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO28_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO28_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO28_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO28_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO28_PUE_MSB, 3
.equ	PADS_BANK0_GPIO28_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO28_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO28_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO28_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO28_PDE_MSB, 2
.equ	PADS_BANK0_GPIO28_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO28_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO28_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO28_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO28_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO28_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO28_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO28_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO28_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO28_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO28_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO29
.equ	PADS_BANK0_GPIO29_OFFSET, 0x00000078
.equ	PADS_BANK0_GPIO29_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO29_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO29_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO29_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO29_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO29_ISO_MSB, 8
.equ	PADS_BANK0_GPIO29_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO29_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO29_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO29_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO29_OD_MSB, 7
.equ	PADS_BANK0_GPIO29_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO29_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO29_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO29_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO29_IE_MSB, 6
.equ	PADS_BANK0_GPIO29_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO29_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO29_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO29_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO29_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO29_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO29_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO29_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO29_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO29_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO29_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO29_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO29_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO29_PUE_MSB, 3
.equ	PADS_BANK0_GPIO29_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO29_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO29_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO29_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO29_PDE_MSB, 2
.equ	PADS_BANK0_GPIO29_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO29_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO29_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO29_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO29_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO29_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO29_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO29_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO29_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO29_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO29_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO30
.equ	PADS_BANK0_GPIO30_OFFSET, 0x0000007c
.equ	PADS_BANK0_GPIO30_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO30_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO30_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO30_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO30_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO30_ISO_MSB, 8
.equ	PADS_BANK0_GPIO30_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO30_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO30_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO30_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO30_OD_MSB, 7
.equ	PADS_BANK0_GPIO30_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO30_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO30_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO30_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO30_IE_MSB, 6
.equ	PADS_BANK0_GPIO30_IE_LSB, 6
