konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/pads_bank0.inc
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO30_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO30_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO30_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO30_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO30_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO30_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO30_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO30_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO30_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO30_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO30_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO30_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO30_PUE_MSB, 3
.equ	PADS_BANK0_GPIO30_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO30_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO30_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO30_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO30_PDE_MSB, 2
.equ	PADS_BANK0_GPIO30_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO30_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO30_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO30_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO30_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO30_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO30_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO30_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO30_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO30_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO30_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO31
.equ	PADS_BANK0_GPIO31_OFFSET, 0x00000080
.equ	PADS_BANK0_GPIO31_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO31_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO31_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO31_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO31_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO31_ISO_MSB, 8
.equ	PADS_BANK0_GPIO31_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO31_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO31_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO31_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO31_OD_MSB, 7
.equ	PADS_BANK0_GPIO31_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO31_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO31_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO31_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO31_IE_MSB, 6
.equ	PADS_BANK0_GPIO31_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO31_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO31_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO31_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO31_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO31_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO31_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO31_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO31_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO31_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO31_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO31_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO31_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO31_PUE_MSB, 3
.equ	PADS_BANK0_GPIO31_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO31_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO31_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO31_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO31_PDE_MSB, 2
.equ	PADS_BANK0_GPIO31_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO31_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO31_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO31_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO31_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO31_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO31_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO31_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO31_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO31_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO31_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO32
.equ	PADS_BANK0_GPIO32_OFFSET, 0x00000084
.equ	PADS_BANK0_GPIO32_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO32_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO32_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO32_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO32_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO32_ISO_MSB, 8
.equ	PADS_BANK0_GPIO32_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO32_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO32_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO32_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO32_OD_MSB, 7
.equ	PADS_BANK0_GPIO32_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO32_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO32_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO32_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO32_IE_MSB, 6
.equ	PADS_BANK0_GPIO32_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO32_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO32_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO32_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO32_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO32_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO32_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO32_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO32_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO32_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO32_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO32_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO32_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO32_PUE_MSB, 3
.equ	PADS_BANK0_GPIO32_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO32_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO32_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO32_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO32_PDE_MSB, 2
.equ	PADS_BANK0_GPIO32_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO32_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO32_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO32_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO32_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO32_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO32_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO32_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO32_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO32_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO32_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO33
.equ	PADS_BANK0_GPIO33_OFFSET, 0x00000088
.equ	PADS_BANK0_GPIO33_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO33_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO33_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO33_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO33_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO33_ISO_MSB, 8
.equ	PADS_BANK0_GPIO33_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO33_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO33_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO33_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO33_OD_MSB, 7
.equ	PADS_BANK0_GPIO33_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO33_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO33_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO33_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO33_IE_MSB, 6
.equ	PADS_BANK0_GPIO33_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO33_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO33_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO33_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO33_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO33_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO33_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO33_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO33_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO33_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO33_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO33_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO33_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO33_PUE_MSB, 3
.equ	PADS_BANK0_GPIO33_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO33_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO33_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO33_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO33_PDE_MSB, 2
.equ	PADS_BANK0_GPIO33_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO33_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO33_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO33_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO33_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO33_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO33_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO33_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO33_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO33_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO33_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO34
.equ	PADS_BANK0_GPIO34_OFFSET, 0x0000008c
.equ	PADS_BANK0_GPIO34_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO34_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO34_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO34_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO34_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO34_ISO_MSB, 8
.equ	PADS_BANK0_GPIO34_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO34_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO34_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO34_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO34_OD_MSB, 7
.equ	PADS_BANK0_GPIO34_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO34_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO34_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO34_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO34_IE_MSB, 6
.equ	PADS_BANK0_GPIO34_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO34_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO34_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO34_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO34_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO34_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO34_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO34_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO34_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO34_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO34_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO34_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO34_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO34_PUE_MSB, 3
.equ	PADS_BANK0_GPIO34_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO34_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO34_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO34_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO34_PDE_MSB, 2
.equ	PADS_BANK0_GPIO34_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO34_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO34_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO34_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO34_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO34_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO34_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO34_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO34_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO34_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO34_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO35
.equ	PADS_BANK0_GPIO35_OFFSET, 0x00000090
.equ	PADS_BANK0_GPIO35_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO35_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO35_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO35_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO35_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO35_ISO_MSB, 8
.equ	PADS_BANK0_GPIO35_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO35_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO35_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO35_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO35_OD_MSB, 7
.equ	PADS_BANK0_GPIO35_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO35_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO35_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO35_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO35_IE_MSB, 6
.equ	PADS_BANK0_GPIO35_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO35_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO35_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO35_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO35_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO35_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO35_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO35_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO35_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO35_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO35_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO35_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO35_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO35_PUE_MSB, 3
.equ	PADS_BANK0_GPIO35_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO35_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO35_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO35_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO35_PDE_MSB, 2
.equ	PADS_BANK0_GPIO35_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO35_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO35_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO35_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO35_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO35_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO35_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO35_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO35_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO35_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO35_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO36
.equ	PADS_BANK0_GPIO36_OFFSET, 0x00000094
.equ	PADS_BANK0_GPIO36_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO36_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO36_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO36_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO36_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO36_ISO_MSB, 8
.equ	PADS_BANK0_GPIO36_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO36_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO36_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO36_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO36_OD_MSB, 7
.equ	PADS_BANK0_GPIO36_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO36_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO36_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO36_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO36_IE_MSB, 6
.equ	PADS_BANK0_GPIO36_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO36_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO36_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO36_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO36_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO36_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO36_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO36_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO36_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO36_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO36_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO36_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO36_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO36_PUE_MSB, 3
.equ	PADS_BANK0_GPIO36_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO36_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO36_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO36_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO36_PDE_MSB, 2
.equ	PADS_BANK0_GPIO36_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO36_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO36_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO36_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO36_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO36_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO36_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO36_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO36_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO36_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO36_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO37
.equ	PADS_BANK0_GPIO37_OFFSET, 0x00000098
.equ	PADS_BANK0_GPIO37_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO37_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO37_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO37_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO37_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO37_ISO_MSB, 8
.equ	PADS_BANK0_GPIO37_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO37_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO37_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO37_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO37_OD_MSB, 7
.equ	PADS_BANK0_GPIO37_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO37_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO37_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO37_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO37_IE_MSB, 6
.equ	PADS_BANK0_GPIO37_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO37_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO37_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO37_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO37_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO37_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO37_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO37_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO37_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO37_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO37_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO37_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO37_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO37_PUE_MSB, 3
.equ	PADS_BANK0_GPIO37_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO37_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO37_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO37_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO37_PDE_MSB, 2
.equ	PADS_BANK0_GPIO37_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO37_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO37_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO37_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO37_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO37_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO37_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO37_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO37_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO37_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO37_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO38
.equ	PADS_BANK0_GPIO38_OFFSET, 0x0000009c
