konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/pads_bank0.inc
.equ	PADS_BANK0_GPIO38_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO38_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO38_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO38_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO38_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO38_ISO_MSB, 8
.equ	PADS_BANK0_GPIO38_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO38_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO38_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO38_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO38_OD_MSB, 7
.equ	PADS_BANK0_GPIO38_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO38_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO38_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO38_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO38_IE_MSB, 6
.equ	PADS_BANK0_GPIO38_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO38_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO38_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO38_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO38_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO38_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO38_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO38_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO38_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO38_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO38_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO38_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO38_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO38_PUE_MSB, 3
.equ	PADS_BANK0_GPIO38_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO38_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO38_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO38_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO38_PDE_MSB, 2
.equ	PADS_BANK0_GPIO38_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO38_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO38_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO38_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO38_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO38_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO38_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO38_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO38_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO38_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO38_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO39
.equ	PADS_BANK0_GPIO39_OFFSET, 0x000000a0
.equ	PADS_BANK0_GPIO39_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO39_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO39_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO39_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO39_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO39_ISO_MSB, 8
.equ	PADS_BANK0_GPIO39_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO39_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO39_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO39_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO39_OD_MSB, 7
.equ	PADS_BANK0_GPIO39_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO39_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO39_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO39_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO39_IE_MSB, 6
.equ	PADS_BANK0_GPIO39_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO39_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO39_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO39_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO39_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO39_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO39_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO39_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO39_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO39_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO39_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO39_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO39_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO39_PUE_MSB, 3
.equ	PADS_BANK0_GPIO39_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO39_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO39_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO39_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO39_PDE_MSB, 2
.equ	PADS_BANK0_GPIO39_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO39_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO39_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO39_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO39_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO39_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO39_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO39_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO39_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO39_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO39_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO40
.equ	PADS_BANK0_GPIO40_OFFSET, 0x000000a4
.equ	PADS_BANK0_GPIO40_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO40_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO40_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO40_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO40_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO40_ISO_MSB, 8
.equ	PADS_BANK0_GPIO40_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO40_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO40_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO40_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO40_OD_MSB, 7
.equ	PADS_BANK0_GPIO40_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO40_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO40_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO40_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO40_IE_MSB, 6
.equ	PADS_BANK0_GPIO40_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO40_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO40_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO40_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO40_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO40_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO40_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO40_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO40_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO40_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO40_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO40_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO40_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO40_PUE_MSB, 3
.equ	PADS_BANK0_GPIO40_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO40_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO40_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO40_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO40_PDE_MSB, 2
.equ	PADS_BANK0_GPIO40_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO40_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO40_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO40_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO40_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO40_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO40_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO40_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO40_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO40_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO40_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO41
.equ	PADS_BANK0_GPIO41_OFFSET, 0x000000a8
.equ	PADS_BANK0_GPIO41_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO41_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO41_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO41_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO41_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO41_ISO_MSB, 8
.equ	PADS_BANK0_GPIO41_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO41_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO41_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO41_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO41_OD_MSB, 7
.equ	PADS_BANK0_GPIO41_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO41_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO41_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO41_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO41_IE_MSB, 6
.equ	PADS_BANK0_GPIO41_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO41_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO41_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO41_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO41_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO41_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO41_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO41_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO41_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO41_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO41_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO41_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO41_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO41_PUE_MSB, 3
.equ	PADS_BANK0_GPIO41_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO41_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO41_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO41_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO41_PDE_MSB, 2
.equ	PADS_BANK0_GPIO41_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO41_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO41_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO41_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO41_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO41_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO41_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO41_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO41_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO41_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO41_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO42
.equ	PADS_BANK0_GPIO42_OFFSET, 0x000000ac
.equ	PADS_BANK0_GPIO42_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO42_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO42_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO42_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO42_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO42_ISO_MSB, 8
.equ	PADS_BANK0_GPIO42_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO42_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO42_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO42_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO42_OD_MSB, 7
.equ	PADS_BANK0_GPIO42_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO42_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO42_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO42_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO42_IE_MSB, 6
.equ	PADS_BANK0_GPIO42_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO42_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO42_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO42_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO42_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO42_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO42_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO42_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO42_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO42_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO42_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO42_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO42_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO42_PUE_MSB, 3
.equ	PADS_BANK0_GPIO42_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO42_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO42_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO42_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO42_PDE_MSB, 2
.equ	PADS_BANK0_GPIO42_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO42_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO42_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO42_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO42_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO42_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO42_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO42_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO42_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO42_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO42_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO43
.equ	PADS_BANK0_GPIO43_OFFSET, 0x000000b0
.equ	PADS_BANK0_GPIO43_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO43_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO43_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO43_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO43_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO43_ISO_MSB, 8
.equ	PADS_BANK0_GPIO43_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO43_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO43_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO43_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO43_OD_MSB, 7
.equ	PADS_BANK0_GPIO43_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO43_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO43_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO43_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO43_IE_MSB, 6
.equ	PADS_BANK0_GPIO43_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO43_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO43_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO43_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO43_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO43_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO43_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO43_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO43_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO43_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO43_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO43_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO43_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO43_PUE_MSB, 3
.equ	PADS_BANK0_GPIO43_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO43_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO43_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO43_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO43_PDE_MSB, 2
.equ	PADS_BANK0_GPIO43_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO43_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO43_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO43_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO43_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO43_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO43_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO43_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO43_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO43_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO43_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO44
.equ	PADS_BANK0_GPIO44_OFFSET, 0x000000b4
.equ	PADS_BANK0_GPIO44_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO44_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO44_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO44_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO44_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO44_ISO_MSB, 8
.equ	PADS_BANK0_GPIO44_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO44_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO44_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO44_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO44_OD_MSB, 7
.equ	PADS_BANK0_GPIO44_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO44_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO44_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO44_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO44_IE_MSB, 6
.equ	PADS_BANK0_GPIO44_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO44_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO44_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO44_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO44_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO44_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO44_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO44_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO44_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO44_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO44_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO44_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO44_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO44_PUE_MSB, 3
.equ	PADS_BANK0_GPIO44_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO44_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO44_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO44_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO44_PDE_MSB, 2
.equ	PADS_BANK0_GPIO44_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO44_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO44_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO44_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO44_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO44_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO44_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO44_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO44_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO44_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO44_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO45
.equ	PADS_BANK0_GPIO45_OFFSET, 0x000000b8
.equ	PADS_BANK0_GPIO45_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO45_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO45_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO45_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO45_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO45_ISO_MSB, 8
.equ	PADS_BANK0_GPIO45_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO45_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO45_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO45_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO45_OD_MSB, 7
.equ	PADS_BANK0_GPIO45_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO45_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO45_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO45_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO45_IE_MSB, 6
.equ	PADS_BANK0_GPIO45_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO45_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO45_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO45_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO45_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO45_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO45_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO45_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO45_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO45_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO45_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO45_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO45_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO45_PUE_MSB, 3
.equ	PADS_BANK0_GPIO45_PUE_LSB, 3
