konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/pads_bank0.inc
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO45_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO45_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO45_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO45_PDE_MSB, 2
.equ	PADS_BANK0_GPIO45_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO45_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO45_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO45_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO45_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO45_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO45_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO45_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO45_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO45_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO45_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO46
.equ	PADS_BANK0_GPIO46_OFFSET, 0x000000bc
.equ	PADS_BANK0_GPIO46_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO46_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO46_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO46_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO46_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO46_ISO_MSB, 8
.equ	PADS_BANK0_GPIO46_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO46_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO46_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO46_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO46_OD_MSB, 7
.equ	PADS_BANK0_GPIO46_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO46_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO46_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO46_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO46_IE_MSB, 6
.equ	PADS_BANK0_GPIO46_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO46_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO46_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO46_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO46_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO46_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO46_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO46_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO46_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO46_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO46_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO46_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO46_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO46_PUE_MSB, 3
.equ	PADS_BANK0_GPIO46_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO46_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO46_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO46_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO46_PDE_MSB, 2
.equ	PADS_BANK0_GPIO46_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO46_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO46_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO46_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO46_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO46_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO46_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO46_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO46_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO46_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO46_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_GPIO47
.equ	PADS_BANK0_GPIO47_OFFSET, 0x000000c0
.equ	PADS_BANK0_GPIO47_BITS, 0x000001ff
.equ	PADS_BANK0_GPIO47_RESET, 0x00000116
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO47_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_GPIO47_ISO_RESET, 0x1
.equ	PADS_BANK0_GPIO47_ISO_BITS, 0x00000100
.equ	PADS_BANK0_GPIO47_ISO_MSB, 8
.equ	PADS_BANK0_GPIO47_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO47_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_GPIO47_OD_RESET, 0x0
.equ	PADS_BANK0_GPIO47_OD_BITS, 0x00000080
.equ	PADS_BANK0_GPIO47_OD_MSB, 7
.equ	PADS_BANK0_GPIO47_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO47_IE
# Description : Input enable
.equ	PADS_BANK0_GPIO47_IE_RESET, 0x0
.equ	PADS_BANK0_GPIO47_IE_BITS, 0x00000040
.equ	PADS_BANK0_GPIO47_IE_MSB, 6
.equ	PADS_BANK0_GPIO47_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO47_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_GPIO47_DRIVE_RESET, 0x1
.equ	PADS_BANK0_GPIO47_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_GPIO47_DRIVE_MSB, 5
.equ	PADS_BANK0_GPIO47_DRIVE_LSB, 4
.equ	PADS_BANK0_GPIO47_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_GPIO47_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_GPIO47_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_GPIO47_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO47_PUE
# Description : Pull up enable
.equ	PADS_BANK0_GPIO47_PUE_RESET, 0x0
.equ	PADS_BANK0_GPIO47_PUE_BITS, 0x00000008
.equ	PADS_BANK0_GPIO47_PUE_MSB, 3
.equ	PADS_BANK0_GPIO47_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO47_PDE
# Description : Pull down enable
.equ	PADS_BANK0_GPIO47_PDE_RESET, 0x1
.equ	PADS_BANK0_GPIO47_PDE_BITS, 0x00000004
.equ	PADS_BANK0_GPIO47_PDE_MSB, 2
.equ	PADS_BANK0_GPIO47_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO47_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_GPIO47_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_GPIO47_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_GPIO47_SCHMITT_MSB, 1
.equ	PADS_BANK0_GPIO47_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_GPIO47_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_GPIO47_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_GPIO47_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_GPIO47_SLEWFAST_MSB, 0
.equ	PADS_BANK0_GPIO47_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_SWCLK
.equ	PADS_BANK0_SWCLK_OFFSET, 0x000000c4
.equ	PADS_BANK0_SWCLK_BITS, 0x000001ff
.equ	PADS_BANK0_SWCLK_RESET, 0x0000005a
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_SWCLK_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_SWCLK_ISO_RESET, 0x0
.equ	PADS_BANK0_SWCLK_ISO_BITS, 0x00000100
.equ	PADS_BANK0_SWCLK_ISO_MSB, 8
.equ	PADS_BANK0_SWCLK_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_SWCLK_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_SWCLK_OD_RESET, 0x0
.equ	PADS_BANK0_SWCLK_OD_BITS, 0x00000080
.equ	PADS_BANK0_SWCLK_OD_MSB, 7
.equ	PADS_BANK0_SWCLK_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_SWCLK_IE
# Description : Input enable
.equ	PADS_BANK0_SWCLK_IE_RESET, 0x1
.equ	PADS_BANK0_SWCLK_IE_BITS, 0x00000040
.equ	PADS_BANK0_SWCLK_IE_MSB, 6
.equ	PADS_BANK0_SWCLK_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_SWCLK_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_SWCLK_DRIVE_RESET, 0x1
.equ	PADS_BANK0_SWCLK_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_SWCLK_DRIVE_MSB, 5
.equ	PADS_BANK0_SWCLK_DRIVE_LSB, 4
.equ	PADS_BANK0_SWCLK_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_SWCLK_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_SWCLK_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_SWCLK_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_SWCLK_PUE
# Description : Pull up enable
.equ	PADS_BANK0_SWCLK_PUE_RESET, 0x1
.equ	PADS_BANK0_SWCLK_PUE_BITS, 0x00000008
.equ	PADS_BANK0_SWCLK_PUE_MSB, 3
.equ	PADS_BANK0_SWCLK_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_SWCLK_PDE
# Description : Pull down enable
.equ	PADS_BANK0_SWCLK_PDE_RESET, 0x0
.equ	PADS_BANK0_SWCLK_PDE_BITS, 0x00000004
.equ	PADS_BANK0_SWCLK_PDE_MSB, 2
.equ	PADS_BANK0_SWCLK_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_SWCLK_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_SWCLK_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_SWCLK_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_SWCLK_SCHMITT_MSB, 1
.equ	PADS_BANK0_SWCLK_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_SWCLK_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_SWCLK_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_SWCLK_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_SWCLK_SLEWFAST_MSB, 0
.equ	PADS_BANK0_SWCLK_SLEWFAST_LSB, 0
# =============================================================================
# Register    : PADS_BANK0_SWD
.equ	PADS_BANK0_SWD_OFFSET, 0x000000c8
.equ	PADS_BANK0_SWD_BITS, 0x000001ff
.equ	PADS_BANK0_SWD_RESET, 0x0000005a
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_SWD_ISO
# Description : Pad isolation control. Remove this once the pad is configured
#               by software.
.equ	PADS_BANK0_SWD_ISO_RESET, 0x0
.equ	PADS_BANK0_SWD_ISO_BITS, 0x00000100
.equ	PADS_BANK0_SWD_ISO_MSB, 8
.equ	PADS_BANK0_SWD_ISO_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_SWD_OD
# Description : Output disable. Has priority over output enable from
#               peripherals
.equ	PADS_BANK0_SWD_OD_RESET, 0x0
.equ	PADS_BANK0_SWD_OD_BITS, 0x00000080
.equ	PADS_BANK0_SWD_OD_MSB, 7
.equ	PADS_BANK0_SWD_OD_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_SWD_IE
# Description : Input enable
.equ	PADS_BANK0_SWD_IE_RESET, 0x1
.equ	PADS_BANK0_SWD_IE_BITS, 0x00000040
.equ	PADS_BANK0_SWD_IE_MSB, 6
.equ	PADS_BANK0_SWD_IE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_SWD_DRIVE
# Description : Drive strength.
#               0x0 -> 2mA
#               0x1 -> 4mA
#               0x2 -> 8mA
#               0x3 -> 12mA
.equ	PADS_BANK0_SWD_DRIVE_RESET, 0x1
.equ	PADS_BANK0_SWD_DRIVE_BITS, 0x00000030
.equ	PADS_BANK0_SWD_DRIVE_MSB, 5
.equ	PADS_BANK0_SWD_DRIVE_LSB, 4
.equ	PADS_BANK0_SWD_DRIVE_VALUE_2MA, 0x0
.equ	PADS_BANK0_SWD_DRIVE_VALUE_4MA, 0x1
.equ	PADS_BANK0_SWD_DRIVE_VALUE_8MA, 0x2
.equ	PADS_BANK0_SWD_DRIVE_VALUE_12MA, 0x3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_SWD_PUE
# Description : Pull up enable
.equ	PADS_BANK0_SWD_PUE_RESET, 0x1
.equ	PADS_BANK0_SWD_PUE_BITS, 0x00000008
.equ	PADS_BANK0_SWD_PUE_MSB, 3
.equ	PADS_BANK0_SWD_PUE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_SWD_PDE
# Description : Pull down enable
.equ	PADS_BANK0_SWD_PDE_RESET, 0x0
.equ	PADS_BANK0_SWD_PDE_BITS, 0x00000004
.equ	PADS_BANK0_SWD_PDE_MSB, 2
.equ	PADS_BANK0_SWD_PDE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_SWD_SCHMITT
# Description : Enable schmitt trigger
.equ	PADS_BANK0_SWD_SCHMITT_RESET, 0x1
.equ	PADS_BANK0_SWD_SCHMITT_BITS, 0x00000002
.equ	PADS_BANK0_SWD_SCHMITT_MSB, 1
.equ	PADS_BANK0_SWD_SCHMITT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PADS_BANK0_SWD_SLEWFAST
# Description : Slew rate control. 1 = Fast, 0 = Slow
.equ	PADS_BANK0_SWD_SLEWFAST_RESET, 0x0
.equ	PADS_BANK0_SWD_SLEWFAST_BITS, 0x00000001
.equ	PADS_BANK0_SWD_SLEWFAST_MSB, 0
.equ	PADS_BANK0_SWD_SLEWFAST_LSB, 0
# =============================================================================
.endif # _HARDWARE_REGS_PADS_BANK0_H
